//冒泡排序

function bubbleSort(arr){
    var len = arr.length
    var temp
    for(var i=0; i<len-1; i++){
        //内部每一次循环会将最大的一个数值放到最后
        //第1次：比较9次，将10移到第10位 1-2、2-3、3-4、4-5、5-6、6-7、7-8、8-9、9-10 
        //第2次：比较8次，将9移到第9位  1-2、2-3、3-4、4-5、5-6、6-7、7-8、8-9
        //第3次：比较7次，将8移到第8位  1-2、2-3、3-4、4-5、5-6、6-7、7-8
        //第4次：比较6次，将7移到第7位  1-2、2-3、3-4、4-5、5-6、6-7
        //第5次：比较5次，将6移到第6位  1-2、2-3、3-4、4-5、5-6
        //第6次：比较4次，将5移到第5位  1-2、2-3、3-4、4-5
        //第7次：比较3次，将4移到第4位  1-2、2-3、3-4
        //第8次：比较2次，将3移到第3位  1-2、2-3
        //第9次：比较1次，将2移到第2位  1-2
        for(j=0; j<len-1-i; j++){   
            if(arr[j] > arr[j+1]){
                temp = arr[j+1];
                arr[j+1]=arr[j];
                arr[j] = temp;
            }
        }
        console.log(arr)
    }
    return arr;
}

var testArr = [10,9,8,7,6,5,4,3,2,1]
bubbleSort(testArr)
